let <- expand.grid(letters, letters, letters, letters)

tokens <- paste0(let[[1]], let[[2]], let[[3]], let[[4]])

other_tokens <- c("ˏ", "˖", "à", "å", "ａｌｌ", "é", "è", "ə", "ɞ",
                  "ｆｏｒ", "øƒ", "ｔｈｅ", "ｗｅｂ", "ʔ", "ʕ", "ᴥ",
                  "επικός", "π", "σωμα", "φ", "ω", "беспилотник",
                  "буду", "бывших", "в", "вє", "возьми", "всех",
                  "гулага", "для", "если", "женщинах", "живых",
                  "за", "заключенных", "зрителей", "книга",
                  "книгу", "кнопку", "на", "нажмите", "новой",
                  "о", "оставшихся", "очень", "первая", "попытка",
                  "последних", "посмотреть", "приглашает",
                  "работ", "работу", "рад", "родном", "русских",
                  "самоиздать", "своих", "серии", "смогу",
                  "субтитров", "фантастической", "фильм",
                  "я", "языке", "զարթօնք", "את", "הביתה", "המוסיקה",
                  "וישראל", "ליפן", "מביאים", "שלנו", "ه҉҉҉҉҉҉҉҉҉҉҉҉҉")

tokens <- c(other_tokens, tokens)

res <- sample(c(rep(NA, 1000000), tokens))

vocabulary <- setNames(seq_along(tokens), tokens)[seq_len(94457)]


new <- vocabulary[res]
